[
    {
        "id": "mnl_co-op-2025",
        "companyName": "Movement Neuroscience Lab",
        "companyWebsite": "https://www.researchgate.net/lab/Eugene-Tunik-Lab",
        "position": "Embedded Systems Engineer Co-op",
        "logoPath": "/src/assets/experience/mnl_logo.png",
        "description": "Built an integrated stimulator–sensor–control system and modular async API, adding patient-feedback visualization to improve outcomes.",
        "duration": "January 2025 - June 2025",
        "responsibilities": [
            "blah",
            "blah2",
            "blah3"
        ],
        "achievements": [
            "blah",
            "blah2",
            "blah3"
        ], 
        "technologies": [
            "blah",
            "blah2",
            "blah3"
        ],
        "recommendations": [
            {
                "name": "Dave Sherman",
                "linkedIn": "https://www.linkedin.com/in/davidalexsherman/",
                "content": "I had the privilege of mentoring Sarthak during his Northeastern Co-Op placement last spring, where he served as an embedded systems engineer on our team. His performance was nothing short of exceptional.\n\nSarthak successfully developed a sophisticated integrated research-grade system that combined neuromuscular electrical stimulators with both wired and wireless user input devices, plus Bluetooth-connected force gauges. This complex project required not only deep technical expertise but also the ability to navigate the unique challenges of working in a multidisciplinary environment.\n\nWhat truly set Sarthak apart was his remarkable ability to bridge technical and non-technical worlds. Working alongside medical professionals who didn't share his engineering background, he demonstrated exceptional communication skills, translating complex technical concepts into accessible language while maintaining the precision necessary for our research applications.\n\nThroughout the project, Sarthak consistently delivered timely updates, proactively identified potential issues, and engineered efficient solutions to problems as they arose. His adaptability shone when project scope evolved—he embraced changes seamlessly and actually took the work beyond what I had originally envisioned.\n\nSarthak combines strong technical fundamentals with excellent project management instincts and collaborative skills that make him invaluable on any engineering team. Any organization would be fortunate to have someone with his blend of technical expertise, communication abilities, and professional maturity.\n\nI recommend Sarthak without reservation and look forward to seeing the continued impact he'll make in his engineering career.",
                "image": "/src/assets/experience/dave_sherman.jpeg", 
                "relation": "Manager and mentor"
            }

        ]
        
    },
    {
        "id": "neu_ta_2024",
        "companyName": "Northeastern University",
        "position":"Teaching Assistant",
        "companyWebsite": "https://www.khoury.northeastern.edu/",
        "logoPath": "/src/assets/experience/nu_logo.png",
        "description": "Served as Teaching Assistant for Northeastern’s Programming in C++ course, supporting 100+ students via hybrid office hours and rigorous assessments to improve comprehension and project outcomes.",
        "duration": "September 2024 - December 2024",
        "responsibilities": [
            "blah",
            "blah2",
            "blah3"
        ],
        "achievements": [
            "blah",
            "blah2",
            "blah3"
        ],
        "technologies": [
            "blah",
            "blah2",
            "blah3"
        ],
        "recommendations": [
            
        ]
    },
    {
        "id": "wissen_intern_2024",
        "companyName": "Wissen Infotech",
        "companyWebsite": "https://www.wissen.com/",
        "position":"LLM Operations Intern",
        "logoPath": "/src/assets/experience/wissen_logo.png",
        "description": "Architected an LLM accelerator and multi-agent test/auto-fix system, shipping a chain-based codebase that improved efficiency 30%.",
        "duration": "June 2024 - August 2024",
        "responsibilities": [
            "blah",
            "blah2",
            "blah3"
        ],
        "achievements": [
            "blah",
            "blah2",
            "blah3"
        ],
        "technologies": [],
        "recommendations": [
            {
                "name": "Sandeep Thilakan",
                "linkedIn": "https://www.linkedin.com/in/sandeep-thilakan-30b7a513b/",
                "content": "I had the opportunity to mentor Sarthak during his internship at Wissen Infotech. Sarthak is very hands-on and was quick to learn AI tools and frameworks. He demonstrated good problem-solving abilities and, within 2 months, developed an accelerator solution that met our needs. He also communicated effectively during client presentations and showed initiative in mentoring team members. Sarthak's dedication and proactive approach make him a valuable team contributor.",
                "image": "/src/assets/experience/sandeep_thilakan.jpeg",
                "relation": "Mentor"
            },
            {
                "name": "John Loney",
                "linkedIn": "https://www.linkedin.com/in/sandeep-thilakan-30b7a513b/",
                "content": "I had the opportunity of working with Sarthak when he interned under me at Wissen AI. He did a wonderful job working on a solution using Python, AI & LLMs. He built an MVP in just 2 months. He showed initiative, ownership and excellent collaboration skills during that time. With his affable personality and hard working nature he would be an asset to any team he is part of. Would be a pleasure to work with him in the future. All the best Sarthak.",
                "image": "/src/assets/experience/john_loney.jpeg",
                "relation": "Manager"
            }
            
        ]
    },
    {
        "id": "applify_intern_2023",
        "companyName": "Applify",
        "position":"Software Engineer Intern",
        "companyWebsite": "https://www.applify.co/",
        "logoPath": "/src/assets/experience/applify_logo.png",
        "description": "Built a Java+JDBC backend and streamlined Agile on JIRA, reducing errors 25% and improving client communication.",
        "duration": "June 2023 - August 2023",
        "responsibilities": [
            "blah",
            "blah2",
            "blah3"
        ],
        "achievements": [
            "blah",
            "blah2",
            "blah3"
        ],
        "technologies": [],
        "recommendations": [
            
        ]
    }
]