[
  {
    "title": "PawtoGrader",
    "imageSrc": "/assets/projects/pawtograder.png",
    "details": [
      "Led an exclusive Northeastern practicum project as Technical Lead and Client Liaison, delivering major platform extensions for PawtoGrader—an open-source educational system supporting 3,000+ Khoury College CS students.",
      "Owned technical architecture and feature planning while serving as the primary point of contact with Dr. Jonathan Bell, translating faculty needs into scalable, production-ready solutions.",
      "Designed and implemented a production-grade full-stack system using TypeScript and a Supabase backend, including secure role-based access control, survey template reuse, and data integrity safeguards.",
      "Built SurveyJS-powered surveys and Poll-Everywhere–style live polling with real-time classroom interaction, automated group formation, and instructor-controlled workflows.",
      "Delivered robust instructor and TA analytics dashboards, supported by Playwright end-to-end testing and Sentry error monitoring to ensure reliability, observability, and smooth releases at scale."
    ],
    "skills": [
      "Technical Leadership",
      "Client Liaison",
      "System Architecture",
      "TypeScript",
      "Supabase (Backend & Auth)",
      "SurveyJS",
      "Playwright (E2E Testing)",
      "Sentry (Error Monitoring)",
      "Full-Stack Development",
      "Agile Methodology",
      "Open-Source Software"
    ],
    "demo": "https://pawtograder.com",
    "source": "https://github.com/pawtograder/platform",
    "paper": ""
  },
  {
    "title": "AI Powered Communication Assistant",
    "imageSrc": "/assets/projects/ai_com.jpg",
    "details": [
      "Developed an AI-driven chat workflow to streamline professional profile inquiries and automate context-aware follow-ups.",
      "Implemented real-time AI notifications delivering inquiry details (name, email, and message summaries) for rapid response and engagement.",
      "Built with LangChain, LangGraph, and LangServe, leveraging the supervisor architecture for multi-agent coordination.",
      "Deployed a FastAPI backend as a Docker container on AWS App Runner, ensuring scalability and stateless concurrency handling.",
      "Hosted the React + Vite frontend on Netlify, integrated securely with the AWS backend via CORS and environment-based API routing.",
      "Managed environment variables, secrets, and deployment pipelines through AWS ECR, enabling reproducible and portable cloud builds."
    ],
    "skills": [
      "AWS App Runner",
      "AWS Elastic Container Registry",
      "Docker",
      "Python",
      "LangChain",
      "LangGraph",
      "LangServe",
      "Supervisor Architecture",
      "Large Language Models (LLMs)",
      "Workflow Automation",
      "Notification Systems",
      "Streamlit",
      "User Interface Design",
      "Real-Time Communication"
    ],
    "demo": "https://communication-assistant.netlify.app",
    "source": "https://github.com/Sarthak-Kakkar-03/com_agent",
    "paper": ""
  },

  {
    "title": "Portfolio Website",
    "imageSrc": "/assets/projects/project.png",
    "details": [
      "Built with React, React Router DOM, and Tailwind CSS, featuring smooth animations and transitions.",
      "Implemented dark and light mode toggle with default theme settings.",
      "Designed a mobile-first, responsive UI with a clean and modern layout.",
      "Structured content via easily editable JSON configuration files for scalability and flexibility.",
      "Hosted the website on Netlify, allowing for continuous builds and update pipeline."
    ],
    "skills": [
      "React",
      "React Router DOM",
      "Tailwind CSS",
      "Responsive Design",
      "Mobile-First Development",
      "Dark/Light Mode",
      "Animations & Transitions",
      "JSON Configuration",
      "UI/UX Design",
      "Netlify"
    ],
    "demo": "https://skakkar.netlify.app/",
    "source": "https://github.com/Sarthak-Kakkar-03/portfolio-website-v2",
    "paper": ""
  },

  {
    "title": "Squegg Python API",
    "imageSrc": "/assets/projects/squegg_api.jpeg",
    "details": [
      "Reverse-engineered the Bluetooth Low Energy (BLE) protocol of the Squegg smart squeeze ball to enable desktop integration.",
      "Developed an open-source Python API originally built for a medical research lab to stream grip strength data directly into analysis pipelines.",
      "Implemented real-time data streaming with parsing for battery level and squeeze status via a simple command-line interface.",
      "Packaged the project into an executable using PyInstaller for easy deployment in research environments."
    ],
    "skills": [
      "Python",
      "Bluetooth Low Energy (BLE)",
      "API Development",
      "Real-Time Data Streaming",
      "Command-Line Interfaces (CLI)",
      "PyInstaller"
    ],
    "demo": "",
    "source": "https://github.com/Sarthak-Kakkar-03/Squegg_python_protocol",
    "paper": ""
  },

  {
    "title": "Typographic-Latent-Space",
    "imageSrc": "/assets/projects/typographic_latent_space.png",
    "details": [
      "Co-authored an ICLR 2023 paper, “Mapping the Typographic Latent Space of Digits as a Matter of Responsible Design.”",
      "Implemented and trained a β-VAE to learn a latent representation of digit typography, exploring controllable generative factors via distribution sampling.",
      "Built an automated experiment loop that iterates over a predefined configuration map, saving samples and run artifacts (configs, metadata) for reproducibility.",
      "Produced labeled sample grids and artifacts per run to compare training settings and analyze latent space structure."
    ],
    "skills": [
      "Deep Learning",
      "Variational Autoencoders (β-VAE)",
      "Latent Space Analysis",
      "Experiment Automation",
      "Jupyter Notebooks",
      "Model Evaluation",
      "Data Visualization",
      "Reproducible Research"
    ],
    "demo": "",
    "source": "https://github.com/Sarthak-Kakkar-03/Typographic-Latent-Space",
    "paper": "https://openreview.net/forum?id=ufA2FuCGyz"
  },
  {
    "title": "Mixed-Typed Language Design",
    "imageSrc": "/assets/projects/pl.png",
    "details": [
      "Completed an advanced programming languages course focused on the design and implementation of a mixed-typed functional language.",
      "Designed and extended a small language with both statically and dynamically typed components, emphasizing soundness and expressiveness.",
      "Implemented core language features including type checking, interpretation, and evaluation semantics using a principled, formal approach.",
      "Applied concepts from type theory such as type judgments, typing rules, substitution, and operational semantics.",
      "Developed and tested language features through iterative assignments, emphasizing correctness, edge cases, and rigorous reasoning."
    ],
    "skills": [
      "Programming Language Design",
      "Type Systems",
      "Static and Dynamic Typing",
      "Operational Semantics",
      "Interpreter Implementation",
      "Functional Programming",
      "Formal Reasoning"
    ],
    "demo": "",
    "source": "https://github.com/Sarthak-Kakkar-03/Mixed-Typed-Language-Design",
    "paper": ""
  },

  {
    "title": "EcoSim: Dynamic Predator-Prey Ecosystem",
    "imageSrc": "/assets/projects/ecosim_cover.jpeg",
    "details": [
      "Developed a C++ simulation modeling Predator-Prey ecosystem dynamics with advanced object-oriented programming, including inheritance and polymorphism.",
      "Implemented sophisticated critter behaviors and basic game physics to simulate realistic movements and environmental interactions.",
      "Deployed and optimized the simulation on the Khoury server environment, ensuring stability and performance while demonstrating development proficiency."
    ],
    "skills": [
      "C++",
      "Object-Oriented Programming (OOP)",
      "Inheritance & Polymorphism",
      "Game Physics",
      "Simulation Development",
      "Khoury Server Environment",
      "NCurses"
    ],
    "demo": "",
    "source": "",
    "paper": ""
  }
]
